### TALLER FORMATIVO ANALITICA DESCRIPTIVA CON PYTHON. 
#### A partir de lo visto en clases y referencias bibliograficas realice lo siguiente:
* Cargue el dataset CSV en algun repositorio y posteriormente copie la ruta de acceso.
* Por cada linea de codigo, agregue una linea de texto (Markdown) con la interpretación de los resultados obtenidos.
* Haciendo uso de todo lo aprendido y otras que usted haya indagado, agregue al final del notebook 3 ejemplos de analitica descriptiva nuevas (código e interpretación)
* Agregue a su notebook texto smartdown que sea necesario para explicar la metodologia utilizada en el desarrollo de este ejercicio, a manera de reporte para ser leido por la comunidad de interés.
* Suba su jupyter notebook (con el desarrollo de este taller) a un repositorio publico de su cuenta personal Github.
* Comparta con el grupo curso (profesora y estudiantes) el enlace a su github para apreciar el trabajo realizado. Se sugiere crear un repositorio de la asignatura para estos trabajos.
* NOTA: el trabajo es individual.

### Ejercicio
* A partir de la sigueinte referencia

In [1]:
import pandas as pd
url='CardioGoodFitness.csv'
df_sports=pd.read_csv(url)  
df_sports

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
0,TM195,18,Male,14,Single,3,4,29562,112
1,TM195,19,Male,15,Single,2,3,31836,75
2,TM195,19,Female,14,Partnered,4,3,30699,66
3,TM195,19,Male,12,Single,3,3,32973,85
4,TM195,20,Male,13,Partnered,4,2,35247,47
...,...,...,...,...,...,...,...,...,...
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

## esplicación 1
Carga de base de datos para mostrarla en pantalla. se puede reemplazar la url por una base de datos que esté en la nube.

In [4]:
df_sports.describe()

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

## esplicación 2
muestra estadisticas descriptivas como son **media, mediana, min, max, std y conteos de los datos.**

In [5]:
df_sports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

## esplicacion 3
_muestra información de la base como son: **numeros de filas, columnas, índices y tipos de datos. también muestra memoria utilizada.**_

In [6]:
df_sports.shape

(180, 9)

## esplicación 4
*muestra el número de muestras y características. en este caso son 180 muestras, y 9 características*

In [3]:
df_sports.isna().any()

Product          False
Age              False
Gender           False
Education        False
MaritalStatus    False
Usage            False
Fitness          False
Income           False
Miles            False
dtype: bool

## explicación 5
*muestra si falta datos de alguna característica. en este caso como todo está falso (False) está todo correcto para utilizar y no hace falta algún dato.*

In [4]:
pd.crosstab(df_sports['Product'],df_sports['Gender'])

Gender   Female  Male
Product
TM195        40    40
TM498        29    31
TM798         7    33

## explicación 6
muestra los valores que toma género y producto

In [5]:
pd.crosstab(df_sports['Product'],df_sports['MaritalStatus'])

MaritalStatus  Partnered  Single
Product
TM195                 48      32
TM498                 36      24
TM798                 23      17

In [6]:
pd.pivot_table(df_sports, index=['Product','Gender'],
               columns=['MaritalStatus'], aggfunc=['mean'])

                     mean                                             \
                      Age             Education              Fitness
MaritalStatus   Partnered     Single  Partnered     Single Partnered
Product Gender
TM195   Female  28.333333  28.692308  14.888889  15.538462  2.851852
        Male    31.380952  25.631579  15.428571  14.473684  2.857143
TM498   Female  30.000000  28.142857  15.200000  15.214286  2.933333
        Male    30.380952  25.200000  15.285714  14.500000  2.904762
TM798   Female  29.000000  24.333333  17.500000  18.333333  5.000000
        Male    30.000000  28.928571  17.421053  16.928571  4.631579

                                                                              \
                                Income                     Miles
MaritalStatus     Single     Partnered        Single   Partnered      Single
Product Gender
TM195   Female  2.923077  46153.777778  45742.384615   74.925926   78.846154
        Male    3.263158  50028.000000  43265.842105   80.190476   99.526316
TM498   Female  2.785714  49724.800000  48920.357143   94.000000   80.214286
        Male    3.000000  49378.285714  47071.800000   87.238095   91.100000
TM798   Female  4.000000  84972.250000  58516.000000  215.000000  133.333333
        Male    4.642857  81431.368421  68216.428571  176.315789  147.571429


                   Usage
MaritalStatus  Partnered    Single
Product Gender
TM195   Female  2.851852  3.000000
        Male    3.285714  3.263158
TM498   Female  3.333333  2.928571
        Male    2.857143  3.300000
TM798   Female  5.250000  4.666667
        Male    4.842105  4.571429

In [7]:
print(df_sports.groupby('Product').size())

Product
TM195    80
TM498    60
TM798    40
dtype: int64

*agrupa los productos y muestra sus cantidades. en este caso está mostrando **80 TM195, 60 TM498, 40 TM798***

In [8]:
df_sports['Age'].mean()

28.788888888888888

*calcula la media de las edades que en este caso es 28.78*

In [9]:
df_sports['Income'].median()

50596.5

_muestra la mediana de los ingresos. en este caso: 50596.5_

In [10]:
df_sports['Age'].std()

6.943498135399795

_muestra la desviación estándar de la edad. en este caso es de: 6.943_

In [12]:
import seaborn as sns
sns.countplot(x='Product', hue='Gender',data=df_sports)

ModuleNotFoundError: No module named 'seaborn'

In [ ]:
sns.distplot(df_sports['Age'])

In [ ]:
import matplotlib.pyplot as plt
age_sports=df_sports['Age']
plt.hist(age_sports,color="blue",label="Age") 
plt.show()

# Una vez que ejecute ejecute el codigo para generar el grafico de tipo histograma, proceda a configurarlo (titulo,labels,color,otros)

In [ ]:
df_sports.hist(by='Gender',column='Age')

In [ ]:
df_sports.hist(by='Gender',column='Income',figsize=(20,30))

In [ ]:
plt.bar(df_sports['Product'],df_sports["Age"])
plt.show()
# Una vez que ejecute ejecute el codigo para generar el grafico de tipo histograma, proceda a configurarlo (titulo,labels,color, otros)

In [ ]:
plt.scatter(df_sports['Product'],df_sports["Income"])
plt.show()
# Una vez que ejecute ejecute el codigo para generar el grafico de tipo histograma, proceda a configurarlo (titulo,labels,color, otros)

In [ ]:
print(df_sports.corr())